Project/Toir/src/InformationRegisters/гкс_ТекущиеФМОР/гкс_ТекущиеФМОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ТекущиеФМОР</name>
  <resources>
    <name>ФМ</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ТМ</name>
    <type>
      <types>CatalogRef.гкс_ТехническиеМеста</types>
    </type>
  </resources>
  <resources>
    <name>ТМФМ</name>
    <type>
      <types>CatalogRef.гкс_ТехническиеМеста</types>
    </type>
  </resources>
  <dimensions>
    <name>ОР</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_КодировкаОР/гкс_КодировкаОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_КодировкаОР</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОР</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗаявкиПоРемонтам/торо_ЗаявкиПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗаявкиПоРемонтам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УточнениеИсполнителя</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.торо_РемонтныеБригады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗавершенныеРемонтныеРаботы/торо_ЗавершенныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗавершенныеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <comment> //TOIR20-370: включенно индексирование для ДатаНачала и ДатаОкончания</comment>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.торо_ДокументыПлановыхДатРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНачалаЦепочки</name>
    <type>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ЭтоПереносРемонта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Ремонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_ИерархияТехКарт/гкс_ИерархияТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ИерархияТехКарт</name>
  <resources>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <dimensions>
    <name>Подчиненный</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_ОжидаемыеМероприятияЕвобланк/гкс_ОжидаемыеМероприятияЕвобланк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ОжидаемыеМероприятияЕвобланк</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Мероприятие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Срок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <comment>TOIR20-462</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>DocumentRef.гкс_ЕВОБланк</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/гкс_РегистрацияЗначенийВнешнихПоказателей/гкс_РегистрацияЗначенийВнешнихПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РегистрацияЗначенийВнешнихПоказателей</name>
  <attributes>
    <name>ДатаНедели</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭффективностьРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнениеПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>ТипРабот</name>
      <type>
        <types>EnumRef.гкс_ТипыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД_Ремонта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗавершенВовремя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланВНужномПериоде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Catalogs/торо_СтатусыСогласованияДокументовРемонтныхРабот/торо_СтатусыСогласованияДокументовРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СтатусыСогласованияДокументовРемонтныхРабот</name>
  <predefined>
    <items>
      <name>Завершен</name>
      <description>Завершен</description>
    </items>
    <items>
      <name>Исполняется</name>
      <description>Исполняется</description>
    </items>
    <items>
      <name>НаИспытании</name>
      <description>На испытании</description>
    </items>
    <items>
      <name>НаСогласовании</name>
      <description>На согласовании</description>
    </items>
    <items>
      <name>НаУтверждении</name>
      <description>На утверждении</description>
    </items>
    <items>
      <name>НеСогласован</name>
      <description>Не согласован</description>
    </items>
    <items>
      <name>ПринятКИсполнению</name>
      <description>Принят к исполнению</description>
    </items>
    <items>
      <name>Приостановлен</name>
      <description>Приостановлен</description>
    </items>
    <items>
      <name>Согласован</name>
      <description>Согласован</description>
    </items>
    <items>
      <name>Создан</name>
      <description>Создан</description>
    </items>
    <items>
      <name>Черновик</name>
      <description>Черновик</description>
    </items>
  </predefined>
</mdclass:Catalog>

Project/Toir/src/CommonModules/гкс_ОбщегоНазначенияСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Находит ОР по Измерению и обновляет у них Кодировку
Процедура ОбновитьКодировкиОР(Измерение) Экспорт
	ТипИзмерения = ТипЗнч(Измерение);
	Если ТипИзмерения = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда 
		ОбновитьКодировкуПоСсылкеОР(Измерение);
	ИначеЕсли ТипИзмерения = Тип("СправочникСсылка.торо_ТиповыеОР") Тогда 
		ОбновитьКодировкуПоСсылкеТОР(Измерение);
	ИначеЕсли ТипИзмерения = Тип("СправочникСсылка.торо_НаправленияОбъектовРемонтныхРабот") Тогда 
		ОбновитьКодировкуПоНаправлению(Измерение);
	ИначеЕсли ТипИзмерения = Тип("СправочникСсылка.гкс_МестаИПлощадки") Тогда 
		ОбновитьКодировкуПоТехМесту(Измерение, ".МестоПлощадка");
	ИначеЕсли ТипИзмерения = Тип("СправочникСсылка.гкс_ЗаводыИПодразделения") Тогда 
		ОбновитьКодировкуПоТехМесту(Измерение, ".ЗаводПодразделение");
	ИначеЕсли ТипИзмерения = Тип("СправочникСсылка.гкс_Участки") Тогда 
		ОбновитьКодировкуПоТехМесту(Измерение, ".Участок");
	ИначеЕсли ТипИзмерения = Тип("СправочникСсылка.гкс_ТехническиеМеста") Тогда 
		ОбновитьКодировкуПоТехМесту(Измерение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьКодировкуПоСсылкеОР(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР,
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТОР
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
		|			ТОГДА гкс_ТекущиеФМОР.ТМ
		|		ИНАЧЕ гкс_ТекущиеФМОР.ТМФМ
		|	КОНЕЦ КАК ТМ,
		|	гкс_ТекущиеФМОР.ОР КАК ОР
		|ПОМЕСТИТЬ НужноеТМ
		|ИЗ
		|	РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|ГДЕ
		|	гкс_ТекущиеФМОР.ОР = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТОР.ТиповойОР.Направление.гкс_Кодировка, """") КАК Направление,
		|	ЕСТЬNULL(НужноеТМ.ТМ.МестоПлощадка.Кодировка, """") КАК Площадка,
		|	ЕСТЬNULL(НужноеТМ.ТМ.ЗаводПодразделение.Кодировка, """") КАК Завод,
		|	ЕСТЬNULL(НужноеТМ.ТМ.Участок.Кодировка, """") КАК Участок,
		|	ЕСТЬNULL(ТОР.Ссылка, НужноеТМ.ОР) КАК Ссылка
		|ИЗ
		|	ТОР КАК ТОР
		|		ПОЛНОЕ СОЕДИНЕНИЕ НужноеТМ КАК НужноеТМ
		|		ПО ТОР.Ссылка = НужноеТМ.ОР";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.гкс_КодировкаОР.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОР.Установить(Выборка.Ссылка);
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ОР = Выборка.Ссылка;
		НоваяЗапись.Текст = Строка(Выборка.Площадка) + "." + Выборка.Завод + "." + Выборка.Участок + "." + Выборка.Направление;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьКодировкуПоСсылкеТОР(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР,
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТОР
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.ТиповойОР = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
		|			ТОГДА гкс_ТекущиеФМОР.ТМ
		|		ИНАЧЕ гкс_ТекущиеФМОР.ТМФМ
		|	КОНЕЦ КАК ТМ,
		|	гкс_ТекущиеФМОР.ОР КАК ОР
		|ПОМЕСТИТЬ НужноеТМ
		|ИЗ
		|	ТОР КАК ТОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|		ПО ТОР.Ссылка = гкс_ТекущиеФМОР.ОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТОР.ТиповойОР.Направление.гкс_Кодировка, """") КАК Направление,
		|	ЕСТЬNULL(НужноеТМ.ТМ.МестоПлощадка.Кодировка, """") КАК Площадка,
		|	ЕСТЬNULL(НужноеТМ.ТМ.ЗаводПодразделение.Кодировка, """") КАК Завод,
		|	ЕСТЬNULL(НужноеТМ.ТМ.Участок.Кодировка, """") КАК Участок,
		|	ЕСТЬNULL(ТОР.Ссылка, НужноеТМ.ОР) КАК Ссылка
		|ИЗ
		|	ТОР КАК ТОР
		|		ПОЛНОЕ СОЕДИНЕНИЕ НужноеТМ КАК НужноеТМ
		|		ПО ТОР.Ссылка = НужноеТМ.ОР";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.гкс_КодировкаОР.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОР.Установить(Выборка.Ссылка);
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ОР = Выборка.Ссылка;
		НоваяЗапись.Текст = Строка(Выборка.Площадка) + "." + Выборка.Завод + "." + Выборка.Участок + "." + Выборка.Направление;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьКодировкуПоНаправлению(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР,
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТОР
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.ТиповойОР.Направление = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
		|			ТОГДА гкс_ТекущиеФМОР.ТМ
		|		ИНАЧЕ гкс_ТекущиеФМОР.ТМФМ
		|	КОНЕЦ КАК ТМ,
		|	гкс_ТекущиеФМОР.ОР КАК ОР
		|ПОМЕСТИТЬ НужноеТМ
		|ИЗ
		|	ТОР КАК ТОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|		ПО ТОР.Ссылка = гкс_ТекущиеФМОР.ОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТОР.ТиповойОР.Направление.гкс_Кодировка, """") КАК Направление,
		|	ЕСТЬNULL(НужноеТМ.ТМ.МестоПлощадка.Кодировка, """") КАК Площадка,
		|	ЕСТЬNULL(НужноеТМ.ТМ.ЗаводПодразделение.Кодировка, """") КАК Завод,
		|	ЕСТЬNULL(НужноеТМ.ТМ.Участок.Кодировка, """") КАК Участок,
		|	ЕСТЬNULL(ТОР.Ссылка, НужноеТМ.ОР) КАК Ссылка
		|ИЗ
		|	ТОР КАК ТОР
		|		ПОЛНОЕ СОЕДИНЕНИЕ НужноеТМ КАК НужноеТМ
		|		ПО ТОР.Ссылка = НужноеТМ.ОР";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.гкс_КодировкаОР.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОР.Установить(Выборка.Ссылка);
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ОР = Выборка.Ссылка;
		НоваяЗапись.Текст = Строка(Выборка.Площадка) + "." + Выборка.Завод + "." + Выборка.Участок + "." + Выборка.Направление;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьКодировкуПоТехМесту(Ссылка, Реквизит = "")

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
		|			ТОГДА гкс_ТекущиеФМОР.ТМ
		|		ИНАЧЕ гкс_ТекущиеФМОР.ТМФМ
		|	КОНЕЦ КАК ТМ,
		|	гкс_ТекущиеФМОР.ОР КАК ОР
		|ПОМЕСТИТЬ ВсеТМ
		|ИЗ
		|	РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеТМ.ТМ КАК ТМ,
		|	ВсеТМ.ОР КАК ОР
		|ПОМЕСТИТЬ НужноеТМ
		|ИЗ
		|	ВсеТМ КАК ВсеТМ
		|ГДЕ
		|	ВсеТМ.ТМ" + Реквизит + " = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР,
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТОР
		|ИЗ
		|	НужноеТМ КАК НужноеТМ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО НужноеТМ.ОР = торо_ОбъектыРемонта.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ТОР.ТиповойОР.Направление.гкс_Кодировка, """") КАК Направление,
		|	ЕСТЬNULL(НужноеТМ.ТМ.МестоПлощадка.Кодировка, """") КАК Площадка,
		|	ЕСТЬNULL(НужноеТМ.ТМ.ЗаводПодразделение.Кодировка, """") КАК Завод,
		|	ЕСТЬNULL(НужноеТМ.ТМ.Участок.Кодировка, """") КАК Участок,
		|	ЕСТЬNULL(ТОР.Ссылка, НужноеТМ.ОР) КАК Ссылка
		|ИЗ
		|	ТОР КАК ТОР
		|		ПОЛНОЕ СОЕДИНЕНИЕ НужноеТМ КАК НужноеТМ
		|		ПО ТОР.Ссылка = НужноеТМ.ОР";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		// гкс+ [12.22] Деснол 13.12.2022
		Если Не ЗначениеЗаполнено(Выборка.Ссылка) Тогда 
			Продолжить;
		КонецЕсли;
		// гкс- [12.22] Деснол 13.12.2022
		НаборЗаписей = РегистрыСведений.гкс_КодировкаОР.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОР.Установить(Выборка.Ссылка);
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ОР = Выборка.Ссылка;
		НоваяЗапись.Текст = Строка(Выборка.Площадка) + "." + Выборка.Завод + "." + Выборка.Участок + "." + Выборка.Направление;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ИзменитьВидимостьКнопкиОтправкиНаСогласование(Кнопка, Статус)Экспорт
	Если Статус = Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Черновик Тогда 
		Кнопка.Видимость = Истина;
	Иначе
		Кнопка.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ОтправитьНаСогласованиеНаСервере(Параметры1, Параметры2)Экспорт
			
	Параметры1.Вставить("ВыбранныйСтатус", Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Создан);
	Параметры1.Вставить("Комментарий", "Отправлен на согласование. " + Строка(ПараметрыСеанса.ТекущийПользователь));
	Параметры1.Вставить("УстановитьПринудительно", Истина);
	
	Список1 = Новый СписокЗначений();
	Список1.Добавить(Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Создан);
	Параметры2.Вставить("СписокСледующихСтатусов", Список1);
	Параметры2.Вставить("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

Процедура ДобавитьКатегориюРискаВТЧ(Форма, ИмяТЧ, Положение) Экспорт
	НЭлем = Форма.Элементы.Добавить("гкс_КатегорияРиска", Тип("ПолеФормы"), Форма.Элементы[ИмяТЧ]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.РемонтыОборудования.ОбъектРемонта.гкс_КатегорияРиска";
	Форма.Элементы.Переместить(Форма.Элементы["гкс_КатегорияРиска"], Форма.Элементы[ИмяТЧ], Форма.Элементы[Положение]);
	// гкс+ [] Деснол 16.08.2022
	НЭлем.Заголовок = НСтр("ru='Категория риска';en='Risk kategory'");
	// гкс- [] Деснол 16.08.2022
	//
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ЦветКР", Новый ОписаниеТипов("Число"), "Объект.РемонтыОборудования"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_КатегорияРискаЦвет", Новый ОписаниеТипов("Цвет"), "Объект.РемонтыОборудования"));
	Форма.ИзменитьРеквизиты(МассивРеквизитов);
	//
	ДобавитьУОКатегорииРиска(Форма);
КонецПроцедуры

Процедура ДобавитьУОКатегорииРиска(Форма)Экспорт
	СтрЭлементы = Новый Структура("гкс_КатегорияРиска", Неопределено);
	ЗаполнитьЗначенияСвойств(СтрЭлементы, Форма.Элементы);
	Если СтрЭлементы.гкс_КатегорияРиска = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	//
	УсловноеОформление = Форма.УсловноеОформление;
	Номер = 1;
	Цвет = WebЦвета.Белый;
	//
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(ТЧ.ОбъектРемонта КАК Справочник.торо_ОбъектыРемонта) КАК ОбъектРемонта, ТЧ.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ Исходные
	               |ИЗ
	               |	&ТЧ КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Исходные.ОбъектРемонта КАК ОбъектРемонта, Исходные.НомерСтроки КАК НомерСтроки,
	               |	торо_КатегорииРиска.Цвет КАК Цвет
	               |ИЗ
	               |	Исходные КАК Исходные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_КатегорииРиска КАК торо_КатегорииРиска
	               |		ПО Исходные.ОбъектРемонта.гкс_КатегорияРиска = торо_КатегорииРиска.Ссылка";
	Запрос.УстановитьПараметр("ТЧ",Форма.Объект.РемонтыОборудования.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Цвет = Выборка.Цвет.Получить();
			Форма.Объект.РемонтыОборудования[Выборка.НомерСтроки-1].гкс_ЦветКР = Номер;
			ИмяОформления = "ЦветКР"+Номер;
			ЭлементУсловногоОформления = Неопределено;
			Для Каждого СМ Из УсловноеОформление.Элементы Цикл
				Если СМ.Представление = ИмяОформления Тогда 
					ЭлементУсловногоОформления = СМ;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЭлементУсловногоОформления = Неопределено Тогда 
				ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
				ЭлементУсловногоОформления.Представление = ИмяОформления;
			КонецЕсли;
			
			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РемонтыОборудования.гкс_ЦветКР"); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено; 
			ЭлементОтбора.ПравоеЗначение = Номер;
			
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Цвет);
			Форма.Объект.РемонтыОборудования[Выборка.НомерСтроки-1].гкс_КатегорияРискаЦвет = Цвет;
			
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("гкс_КатегорияРиска");
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("гкс_КатегорияРискаЦвет");
			//
			Номер = Номер + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура гкс_РегистрацияЗначенийВнешнихПоказателей() Экспорт
	ДатаОкончания = НачалоНедели(ТекущаяДата()) - 1;
	ДатаНачала = НачалоНедели(ДатаОкончания);
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Заявки.IDРемонта КАК ИД_Ремонта,
		|	Заявки.Регистратор КАК Заявка,
		|	Завершенные.ДатаНачала КАК ДатаНачала,
		|	Завершенные.Регистратор КАК Акт,
		|	НЕ Завершенные.Регистратор ЕСТЬ NULL КАК Завершен,
		|	ЕСТЬNULL(Актуальные.ДатаНачала, Заявки.ДатаНачалаРемонтныхРабот) КАК ДатаНачалаПлан
		|ПОМЕСТИТЬ ВсеРемонты
		|ИЗ
		|	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт) КАК Заявки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(, ) КАК Завершенные
		|		ПО (Завершенные.ID = Заявки.IDРемонта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК Актуальные
		|		ПО Заявки.IDРемонта = Актуальные.IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеРемонты.ИД_Ремонта КАК ИД_Ремонта,
		|	ВсеРемонты.Акт КАК Акт,
		|	ВсеРемонты.Заявка КАК Заявка
		|ПОМЕСТИТЬ РемонтыПериода0
		|ИЗ
		|	ВсеРемонты КАК ВсеРемонты
		|ГДЕ
		|	ВсеРемонты.Завершен
		|	И ВсеРемонты.ДатаНачала < &ДатаОкончания
		|	И ВсеРемонты.ДатаНачала >= &ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеРемонты.ИД_Ремонта КАК ИД_Ремонта,
		|	ВсеРемонты.Акт КАК Акт,
		|	ВсеРемонты.Заявка КАК Заявка,
		|	ВсеРемонты.Завершен КАК Завершен,
		|	ВсеРемонты.Завершен
		|		И (ВсеРемонты.ДатаНачала < &ДатаОкончания
		|			И ВсеРемонты.ДатаНачала >= &ДатаНачала) КАК ЗавершенВовремя
		|ПОМЕСТИТЬ ПлановыеРемонтыПериода
		|ИЗ
		|	ВсеРемонты КАК ВсеРемонты
		|ГДЕ
		|	ВсеРемонты.ДатаНачалаПлан < &ДатаОкончания
		|	И ВсеРемонты.ДатаНачалаПлан >= &ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(РемонтыПериода0.ИД_Ремонта, ПлановыеРемонтыПериода.ИД_Ремонта) КАК ИД_Ремонта,
		|	ЕСТЬNULL(РемонтыПериода0.Акт, ПлановыеРемонтыПериода.Акт) КАК Акт
		|ПОМЕСТИТЬ ИспользуемыеЗавершенныеРемонты
		|ИЗ
		|	РемонтыПериода0 КАК РемонтыПериода0
		|		ПОЛНОЕ СОЕДИНЕНИЕ ПлановыеРемонтыПериода КАК ПлановыеРемонтыПериода
		|		ПО РемонтыПериода0.ИД_Ремонта = ПлановыеРемонтыПериода.ИД_Ремонта
		|ГДЕ
		|	(ПлановыеРемонтыПериода.Завершен ЕСТЬ NULL
		|			ИЛИ ПлановыеРемонтыПериода.Завершен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеРемонты.ИД_Ремонта КАК ИД_Ремонта
		|ПОМЕСТИТЬ РемонтыКонтрагентов
		|ИЗ
		|	ИспользуемыеЗавершенныеРемонты КАК ВсеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ИсполнителиПоРемонтам КАК Исполнители
		|		ПО ВсеРемонты.Акт = Исполнители.Ссылка
		|			И ВсеРемонты.ИД_Ремонта = Исполнители.РемонтыОборудования_ID
		|			И (Исполнители.НомерСтроки = 1)
		|			И (Исполнители.Исполнитель ССЫЛКА Справочник.Контрагенты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеРемонты.ИД_Ремонта КАК ИД_Ремонта,
		|	ВсеРемонты.Акт КАК Акт,
		|	ВсеРемонты.Заявка КАК Заявка
		|ПОМЕСТИТЬ РемонтыПериода
		|ИЗ
		|	РемонтыПериода0 КАК ВсеРемонты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РемонтыКонтрагентов КАК РемонтыКонтрагентов
		|		ПО (РемонтыКонтрагентов.ИД_Ремонта = ВсеРемонты.ИД_Ремонта)
		|ГДЕ
		|	РемонтыКонтрагентов.ИД_Ремонта ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(РемонтыПериода.ИД_Ремонта, ПлановыеРемонтыПериода.ИД_Ремонта) КАК ИД_Ремонта,
		|	ЕСТЬNULL(ПлановыеРемонтыПериода.Заявка, РемонтыПериода.Заявка) КАК Заявка,
		|	ЕСТЬNULL(ПлановыеРемонтыПериода.Акт, РемонтыПериода.Акт) КАК Акт,
		|	ЕСТЬNULL(ПлановыеРемонтыПериода.Завершен, ИСТИНА) КАК Завершен,
		|	НЕ ПлановыеРемонтыПериода.ИД_Ремонта ЕСТЬ NULL КАК ПланВНужномПериоде,
		|	ЕСТЬNULL(ПлановыеРемонтыПериода.ЗавершенВовремя, ИСТИНА) КАК ЗавершенВовремя
		|ПОМЕСТИТЬ ВсеИспользуемыеРемонты
		|ИЗ
		|	РемонтыПериода КАК РемонтыПериода
		|		ПОЛНОЕ СОЕДИНЕНИЕ ПлановыеРемонтыПериода КАК ПлановыеРемонтыПериода
		|			ЛЕВОЕ СОЕДИНЕНИЕ РемонтыКонтрагентов КАК РемонтыКонтрагентов
		|			ПО (РемонтыКонтрагентов.ИД_Ремонта = ПлановыеРемонтыПериода.ИД_Ремонта)
		|		ПО РемонтыПериода.ИД_Ремонта = ПлановыеРемонтыПериода.ИД_Ремонта
		|ГДЕ
		|	РемонтыКонтрагентов.ИД_Ремонта ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РемонтыПериода.ИД_Ремонта КАК ИД_Ремонта,
		|	СУММА(ТЧ.ВремяРаботы) КАК Факт
		|ПОМЕСТИТЬ ФактВремяАктов
		|ИЗ
		|	ВсеИспользуемыеРемонты КАК РемонтыПериода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ТрудовыеЗатраты КАК ТЧ
		|		ПО РемонтыПериода.ИД_Ремонта = ТЧ.РемонтыОборудования_ID
		|			И РемонтыПериода.Акт = ТЧ.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РемонтыПериода.ИД_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РемонтыПериода.ИД_Ремонта КАК ИД_Ремонта,
		|	МАКСИМУМ(торо_Ремонты.ВидРемонта.гкс_ТипРабот) КАК ТипРабот,
		|	МАКСИМУМ(торо_Ремонты.ОбъектРемонта.Направление.гкс_Служба) КАК Служба,
		|	торо_Ремонты.ОбъектРемонта КАК ОР
		|ПОМЕСТИТЬ ТипыРаботРемонтов
		|ИЗ
		|	ВсеИспользуемыеРемонты КАК РемонтыПериода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
		|		ПО РемонтыПериода.ИД_Ремонта = торо_Ремонты.ID
		|
		|СГРУППИРОВАТЬ ПО
		|	РемонтыПериода.ИД_Ремонта,
		|	торо_Ремонты.ОбъектРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РемонтыПериода.ИД_Ремонта КАК ИД_Ремонта,
		|	РемонтыПериода.Заявка КАК Заявка,
		|	СУММА(ТЧ.ВремяРаботы * ТЧ.Количество) КАК ВремяРаботы
		|ПОМЕСТИТЬ ПланВремяЗаявок
		|ИЗ
		|	ВсеИспользуемыеРемонты КАК РемонтыПериода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК ТЧ
		|		ПО РемонтыПериода.Заявка = ТЧ.Ссылка
		|			И РемонтыПериода.ИД_Ремонта = ТЧ.РемонтыОборудования_ID
		|			И (ТЧ.ВремяРаботы > 0)
		|			И (ТЧ.Количество > 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	РемонтыПериода.ИД_Ремонта,
		|	РемонтыПериода.Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеИД.ИД_Ремонта КАК ИД_Ремонта,
		|	ЕСТЬNULL(ФактВремяАктов.Факт, 0) КАК Факт,
		|	ЕСТЬNULL(ПланВремяЗаявок.ВремяРаботы, 0) КАК План,
		|	ВсеИД.ПланВНужномПериоде КАК ПланВНужномПериоде,
		|	ВсеИД.ЗавершенВовремя КАК ЗавершенВовремя
		|ПОМЕСТИТЬ РемонтыСоВременемРаботы
		|ИЗ
		|	ВсеИспользуемыеРемонты КАК ВсеИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ФактВремяАктов КАК ФактВремяАктов
		|		ПО ВсеИД.ИД_Ремонта = ФактВремяАктов.ИД_Ремонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВремяЗаявок КАК ПланВремяЗаявок
		|		ПО ВсеИД.ИД_Ремонта = ПланВремяЗаявок.ИД_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВсеИд.План) КАК План,
		|	СУММА(ВсеИд.Факт) КАК Факт,
		|	ТипыРаботРемонтов.ТипРабот КАК ТипРабот,
		|	ТипыРаботРемонтов.ОР КАК ОР,
		|	МАКСИМУМ(ВсеИд.ПланВНужномПериоде) КАК ПланВНужномПериоде,
		|	МАКСИМУМ(ВсеИд.ЗавершенВовремя) КАК ЗавершенВовремя,
		|	ВсеИд.ИД_Ремонта КАК ИД_Ремонта,
		|	ТипыРаботРемонтов.ОР.Организация КАК Организация
		|ИЗ
		|	РемонтыСоВременемРаботы КАК ВсеИд
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыРаботРемонтов КАК ТипыРаботРемонтов
		|		ПО ВсеИд.ИД_Ремонта = ТипыРаботРемонтов.ИД_Ремонта
		|
		|СГРУППИРОВАТЬ ПО
		|	ТипыРаботРемонтов.ТипРабот,
		|	ТипыРаботРемонтов.ОР,
		|	ВсеИд.ИД_Ремонта,
		|	ТипыРаботРемонтов.ОР.Организация
		|ИТОГИ ПО
		|	Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	гкс_РегистрацияЗначенийВнешнихПоказателей.Ссылка КАК Ссылка,
		|	гкс_РегистрацияЗначенийВнешнихПоказателей.Организация КАК Организация
		|ИЗ
		|	Документ.гкс_РегистрацияЗначенийВнешнихПоказателей КАК гкс_РегистрацияЗначенийВнешнихПоказателей
		|ГДЕ
		|	гкс_РегистрацияЗначенийВнешнихПоказателей.ДатаНедели = &ДатаНачала
		|ИТОГИ ПО
		|	Организация";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	НомерПервогоПакета = 11;
	НомерВторогоПакета = 12;
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДок = РезультатЗапроса[НомерВторогоПакета].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если РезультатЗапроса[НомерПервогоПакета].Пустой() = Ложь Тогда 
		ВыборкаОрг = РезультатЗапроса[НомерПервогоПакета].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОрг.Следующий() Цикл
			ВыборкаДок.Сбросить();
			Если ВыборкаДок.НайтиСледующий(Новый Структура("Организация", ВыборкаОрг.Организация)) Тогда 
				ВыборкаДок1 = ВыборкаДок.Выбрать();
				ВыборкаДок1.Следующий();
				НовыйДок = ВыборкаДок1.Ссылка.ПолучитьОбъект();
				Если НовыйДок.ПометкаУдаления Тогда 
					НовыйДок.УстановитьПометкуУдаления(Ложь);
				КонецЕсли;
				НовыйДок.Показатели.Очистить();
			Иначе
				НовыйДок = Документы.гкс_РегистрацияЗначенийВнешнихПоказателей.СоздатьДокумент();
				НовыйДок.Дата = ТекущаяДата();
				НовыйДок.ДатаНедели = ДатаНачала;
			КонецЕсли;
			Выборка = ВыборкаОрг.Выбрать();
			План = 0;
			Факт = 0;
			План1 = 0;
			Факт1 = 0;
			План2 = 0;
			Факт2 = 0;
			Пока Выборка.Следующий() Цикл
				Если Выборка.План = 0 И Выборка.Факт = 0 Тогда 
					Продолжить;
				КонецЕсли;
				НС = НовыйДок.Показатели.Добавить();
				НС.ТипРабот = Выборка.ТипРабот;
				НС.ВремяРаботы = Выборка.Факт;
				НС.ВремяРаботыПлан = Выборка.План;
				НС.ОбъектРемонта = Выборка.ОР;
				НС.ИД_Ремонта = Выборка.ИД_Ремонта;
				НС.ВремяРаботыСтрокой = СформироватьПродолжительность(НС.ВремяРаботы);
				НС.ПланВНужномПериоде = Выборка.ПланВНужномПериоде;
				НС.ЗавершенВовремя = Выборка.ЗавершенВовремя;
				Если Выборка.ЗавершенВовремя Тогда 
					План1 = План1 + Выборка.План;
					Факт1 = Факт1 + Выборка.Факт;
					Если Выборка.ПланВНужномПериоде Тогда 
						Факт2 = Факт2 + Выборка.Факт;
					КонецЕсли;
				КонецЕсли;
				Если Выборка.ПланВНужномПериоде Тогда 
					План2 = План2 + Выборка.План;
				КонецЕсли;
				План = План + Выборка.План;
				Факт = Факт + Выборка.Факт;
			КонецЦикла;
			Если Факт1 = 0 Тогда 
				НовыйДок.ЭффективностьРабот = 0;
			Иначе
				НовыйДок.ЭффективностьРабот = (План1 / Факт1) * 100;
			КонецЕсли;
			Если План2 = 0 Тогда 
				НовыйДок.ВыполнениеПлана = 0;
			Иначе
				НовыйДок.ВыполнениеПлана = ( Факт2 / План2 ) * 100;
			КонецЕсли;
			НовыйДок.Организация = ВыборкаОрг.Организация;
			НовыйДок.ВремяРаботы = Факт;
			НовыйДок.ВремяРаботыПлан = План;
			НовыйДок.ВремяРаботыСтрокой = СформироватьПродолжительность(План);
			Если План > 0 ИЛИ Факт > 0 Тогда 
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция СформироватьПродолжительность(ПродолжительностьВСекундах)
	
	Если ПродолжительностьВСекундах = 0 Тогда
		
		Возврат "Ввести продолжительность";
		
	Иначе
		
		Часы    = Цел(ПродолжительностьВСекундах / 3600);
		Минуты  = Цел((ПродолжительностьВСекундах - 3600 * Часы) / 60);
		Секунды = ПродолжительностьВСекундах - 3600 * Часы - Минуты * 60;
		
		Возврат "" + Часы + " ч. " + Минуты + " мин. " + Секунды + " с.";
		
	КонецЕсли;
	
КонецФункции

Процедура гкс_ДобавитьУсловноеОформлениеДереваРР(Форма) Экспорт   
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	
	Группа1 = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных")); 
	Группа1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ЭлементОтбора = Группа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.ЭтоТехКарта"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОтбора = Группа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.ID"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено; 
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРаботгкс_СпособВыполнения");


КонецПроцедуры

// Гкс+[TOIR20-169] Селимов 
Функция ТехКартыТиповогоОР(ТОРСсылка, СПодчиенными = Ложь) Экспорт
	
	ДанныеТехКарт = Новый Структура;
	ТехКарты = Новый Массив;
	ПодчиненныеТехКарты = Новый Массив;
	
	ТехКартыТОР(ТОРСсылка, ТехКарты);
	
	Если СПодчиенными Тогда
		ПодчиненныеТехКарты(ТехКарты, ПодчиненныеТехКарты);			
	КонецЕсли; 
	
	ДанныеТехКарт.Вставить("ТехКарты", ТехКарты);
	ДанныеТехКарт.Вставить("ПодчиненныеТехКарты", ПодчиненныеТехКарты);
	
	Возврат ДанныеТехКарт;
	
КонецФункции // } Гкс-[TOIR20-169] 

// Гкс+[TOIR20-169] Селимов
Процедура ТехКартыТОР(ТОРСсылка, ТехКарты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ИдентификаторыТехКарт.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ТехКартаГруппаРодитель
		|ИЗ
		|	Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
		|ГДЕ
		|	торо_ИдентификаторыТехКарт.гкс_Владелец = &гкс_Владелец
		|	И НЕ торо_ИдентификаторыТехКарт.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ИдентификаторыТехКарт.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
		|ГДЕ
		|	торо_ИдентификаторыТехКарт.Родитель В
		|			(ВЫБРАТЬ
		|				ВТ_ТехКартаГруппаРодитель.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_ТехКартаГруппаРодитель КАК ВТ_ТехКартаГруппаРодитель)";
	
	Запрос.УстановитьПараметр("гкс_Владелец", ТОРСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТехКарты.Добавить(Выборка.Ссылка);			
	КонецЦикла; 
	
КонецПроцедуры // } Гкс-[TOIR20-169]              

// Гкс+[TOIR20-169] Селимов
Процедура ПодчиненныеТехКарты(Родители, ПодчиненныеТехКарты) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_ИерархияТехКарт.Подчиненный КАК Подчиненный
		|ИЗ
		|	РегистрСведений.гкс_ИерархияТехКарт КАК гкс_ИерархияТехКарт
		|ГДЕ
		|	гкс_ИерархияТехКарт.Родитель В(&Родители)";
	
	Запрос.УстановитьПараметр("Родители", Родители);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПодчиненныеТехКарты.Добавить(Выборка.Подчиненный);
	КонецЦикла;
	
КонецПроцедуры // } Гкс-[TOIR20-169]   

Процедура гкс_ПроверкаВыполненияМероприятий() Экспорт
	Событие = Константы.гкс_СобытиеПросрочкиМероприятияЕвобланк.Получить();
	Если Не ЗначениеЗаполнено(Событие) Тогда 
		Возврат;
	КонецЕсли;
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Рег.Срок КАК Срок,
	|	Рег.Мероприятие КАК Мероприятие,
	|	Рег.Ответственный КАК Ответственный,
	|	Рег.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрСведений.гкс_ОжидаемыеМероприятияЕвобланк КАК Рег
	|Где Рег.Срок < &ТекДата
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		ОбМодуль = торо_РаботаСУведомлениями;
		ВыборкаДок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДок.Следующий() Цикл
			ДокОб = ВыборкаДок.Ссылка.ПолучитьОбъект();
			СтруктураДанных = Новый Структура();
			торо_РаботаСУведомлениями.ЗаполнитьСтруктуруДанныхДокумента(СтруктураДанных, ДокОб);
			СтруктураДанных.Вставить("ВидДокумента", "гкс_ЕВОБланк");
			Выборка = ВыборкаДок.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтруктураДанных.Вставить("Ответственный", Выборка.Ответственный);
				СтруктураДанных.Вставить("Мероприятие", Выборка.Мероприятие);
				ОбМодуль.ЗаписатьУведомленияФМ(СтруктураДанных, Событие);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
